import {T_Ship} from "src/modules/types.ts";

export const ShipMocks:T_Ship[] = [
    {
        id: 1,
        name: "Starship SN3",
        status: 1,
        image: "",
        description: "Серийный номер Starship 3, или SN3, представлял собой прототип Starship, предназначенный для статических огневых испытаний и полетов на малой высоте. Он был разрушен во время испытаний 3 апреля 2020 года. В баке с жидким кислородом в кормовой части транспортного средства произошла непреднамеренная разгерметизация, в результате чего конструкция рухнула под весом полного метантенка, расположенного выше (который был в центре внимания испытаний).",
        creation_date: "29.03.2020"
    },
    {
        id: 2,
        name: "Starship SN5",
        status: 1,
        image: "",
        description: "У транспортного средства SN5 отсутствует носовой обтекатель, поэтому он немного похож на высокую «летающую водонапорную башню», как и предыдущий испытательный стенд, но он все равно поднимался и опускался со стартовой площадки SpaceX в Бока-Чика, штат Техас.",
        creation_date: "25.09.2020"
    },
    {
        id: 3,
        name: "Starship SN4",
        status: 1,
        image: "",
        description: "Серийный номер Starship 4, или SN4, был прототипом Starship, предназначенным для суборбитальных испытаний. Аппарат прошел все контрольные испытания и стал первым прототипом программы Starship, прошедшим статические испытания со времен Starhopper. SN4 был уничтожен 29 мая 2020 года после успешного статического огневого испытания из-за отказа экспериментальной системы 'быстрого отключения' наземного вспомогательного оборудования.",
        creation_date: "17.04.2020"
    },
    {
        id: 4,
        name: "Starship SN11",
        status: 1,
        image: "",
        description: "SN11 стал четвертым полностью собранным прототипом Starship, прошедшим летные испытания. Это был последний прототип из первых четырех, поскольку Илон Маск объявил о значительных изменениях для SN15 и отмене SN12-14.",
        creation_date: "05.02.2022"
    }
]